#一、输入圆的半径r，求其面积并输出。输入的半径是实数值，圆周率取3.14。
'''a=input('请输入半径:')#默认是字符串型，要转化成整型
a=int(a)
print(f'圆的面积:{3.14*a*a:.2f}')'''

#二、	二、输入的两个整数，输出其和、差、积、商
'''a,b=map(int,input('请输入两个数:').split(','))
print(f'和{a+b}')
print(f'差{a-b}')
print(f'乘{a*b}')
print(f'除{a/b}')'''

#三。编写一个程序，判断输入的年份是否为闰年。
'''a=input('请输入年份:')
a=int(a)
if (a%4==0 and a%100 !=0)or(a%400==0):
    print('是闰年')
else:
    print('不是闰年')'''
'''a=0
for i in range(1,101):
    if i%2==0:
        a=a+i
print(a)'''

#编程求3位数的所有水仙花数。水仙花数是指一个3位数，它的每个位数上的数字的3次幂之和等于它本身（例如：13+53+33=153）
'''a=input('请输入3位数')
a=int(a)
if a>=100 and a<=999:
    b=a%10
    c=(a//10)%10
    d=a//100                        #单个‘/’表示除完结果后会有小数，“//”除完结果后没有小数
    if d*d*d+c*c*c+b*b*b==a:
        print('是水仙花数')
    else:
        print('不是')'''

#创建列表[15, 46, 41, 37, 29, 5, 33]，找出列表中所有大于20且小于40的元素，存入新列表并输出
'''b=[]
a=[15, 46, 41, 37, 29, 5, 33]
for i in a:
    if i>20 and i<40:
        b.append(i)
print(b)
'''

#八、创建一个元组(3, 7, 2, 8, 5, 7, 3, 2, 7, 1)，统计数字7出现的次数并输出
'''a=(3, 7, 2, 8, 5, 7, 3, 2, 7, 1)
print(a.count(7))'''

#创建一个字典存储学生信息：{"101": "张三", "102": "李四", "103": "王五", "104": "赵六"}，输入学号查询姓名，若学号不存在则输出"学号不存在
'''a={"101": "张三", "102": "李四", "103": "王五", "104": "赵六"}
i=input('请输入学号:')
i=str(i)
for b in a:
    if i==b:
        print(f'{a[b]}')
        break
if i!=b:
    print('不存在')'''
#法二
'''a={"101": "张三", "102": "李四", "103": "王五", "104": "赵六"}
b=input('请输入学号')
if b in a:
    print(a[b])
else:
    print('不存在')'''

#用字典编写简单的登录验证系统。让用户输入账号、密码，如账号、密码都输入正确，显示“登录成功”，否则显示“用户名或密码错误!”。账户名密码如下：user1: password123，user2: abc456,user3: "hello2024
a={'user1':'password123','user2':'abc456','user3':'hello2024'}
b,c=(input('请输入账户和密码:').split(' '))
if b in a and a[b]==c:
        print('对')
else:
    print('错')



